{
    "content" :
    [
        {
            "type": "img",
            "url": "/project_imgs/tr_1.png",
            "caption": ""
        },
        {
            "type": "bigtext",
            "text": "An AI-powered web app to simulate table reads for film scripts"
        },
        {
            "type": "para",
            "text": "Table reads are an integral part of script evaluation, providing invaluable insights into a screenplay's strengths and weaknesses before production. Actors typically read the script aloud, allowing creators to assess dialogue, pacing, and character dynamics. Table Read can simulate this crucial process, democratizing access to feedback and enabling more efficient script iteration for writers and filmmakers."
        },
        {
            "type": "headingpara",
            "heading": "The Idea",
            "para": "The backstory behind this is actually pretty interesting. This whole thing first came to life when Mr. Vivek Reddy, CEO of Viga ET, vibe-coded a super simple prototype. It was bare-bones; just a handful of dialogues stitched together using the Eleven Labs API. That early version was shown to me, and from there we kicked off the journey of building a full-fledged product. But since this was truly one of a kind, we basically had to start from scratch, brainstorming, mapping out workflows, and figuring out exactly how users would engage with and experience these dialogues inside the product."
        },
        {
            "type": "img",
            "url": "/project_imgs/tr_2.png",
            "caption": "The initial vibe-coded prototype"
        },
        {
            "type": "headingpara",
            "heading": "The Product",
            "para": "After gathering feedback on the initial demo from our internal artists and directors, we began designing the product. Our primary focus was to maintain the timeline and script dialogues as default features. Additionally, we opted to present voice selection and cloning as modals, as user feedback indicated that the timeline and dialogue script panels were utilized more frequently."
        },
        {
            "type": "img",
            "url": "/project_imgs/tr_4.png",
            "caption": "The final product, designed while vibing to music"
        },
        {
            "type": "img",
            "url": "/project_imgs/tr_3.png",
            "caption": ""
        },
        {
            "type": "img",
            "url": "/project_imgs/tr_5.png",
            "caption": ""
        },
        {
            "type": "img",
            "url": "/project_imgs/tr_6.png",
            "caption": ""
        }
    ],
    "details": {
        "timeline": "2022 - Present",
        "company": "Viga ET",
        "deliverables": [
            "Branding",
            "UI/UX Design"
        ],
        "projectTitle": "TABLE READ",
        "projectLink": "https://moviecolab.com/tableread/"
    },
    "nextWorkTitle": "TABLE READ",
    "nextWorkDescription": "An AI-powered web app to simulate table reads for film scripts"
}
